<template>
    <div class="charts" ref="chartMap"></div>
</template>

<script>
    import echarts from 'echarts/lib/echarts'
    // import '../script/china'
    import 'echarts/map/js/china'
    import 'echarts/lib/chart/lines'
    import 'echarts/lib/chart/effectScatter'

    export default {
        name: 'ChartMap',
        data () {
            return {
                chart: null,
                SZdata: [],
                geoCoordMap: {
                    '上海': [121.4648, 31.2891],
                    '东莞': [113.8953, 22.901],
                    '东营': [118.7073, 37.5513],
                    '中山': [113.4229, 22.478],
                    '临汾': [111.4783, 36.1615],
                    '临沂': [118.3118, 35.2936],
                    '丹东': [124.541, 40.4242],
                    '丽水': [119.5642, 28.1854],
                    '乌鲁木齐': [87.9236, 43.5883],
                    '佛山': [112.8955, 23.1097],
                    '保定': [115.0488, 39.0948],
                    '兰州': [103.5901, 36.3043],
                    '包头': [110.3467, 41.4899],
                    '北京': [116.4551, 40.2539],
                    '北海': [109.314, 21.6211],
                    '南京': [118.8062, 31.9208],
                    '南宁': [108.479, 23.1152],
                    '南昌': [116.0046, 28.6633],
                    '南通': [121.1023, 32.1625],
                    '厦门': [118.1689, 24.6478],
                    '台州': [121.1353, 28.6688],
                    '合肥': [117.29, 32.0581],
                    '呼和浩特': [111.4124, 40.4901],
                    '咸阳': [108.4131, 34.8706],
                    '哈尔滨': [127.9688, 45.368],
                    '唐山': [118.4766, 39.6826],
                    '嘉兴': [120.9155, 30.6354],
                    '大同': [113.7854, 39.8035],
                    '大连': [122.2229, 39.4409],
                    '天津': [117.4219, 39.4189],
                    '太原': [112.3352, 37.9413],
                    '威海': [121.9482, 37.1393],
                    '宁波': [121.5967, 29.6466],
                    '宝鸡': [107.1826, 34.3433],
                    '宿迁': [118.5535, 33.7775],
                    '常州': [119.4543, 31.5582],
                    '广州': [113.5107, 23.2196],
                    '廊坊': [116.521, 39.0509],
                    '延安': [109.1052, 36.4252],
                    '张家口': [115.1477, 40.8527],
                    '徐州': [117.5208, 34.3268],
                    '德州': [116.6858, 37.2107],
                    '惠州': [114.6204, 23.1647],
                    '成都': [103.9526, 30.7617],
                    '扬州': [119.4653, 32.8162],
                    '承德': [117.5757, 41.4075],
                    '拉萨': [91.1865, 30.1465],
                    '无锡': [120.3442, 31.5527],
                    '日照': [119.2786, 35.5023],
                    '昆明': [102.9199, 25.4663],
                    '杭州': [119.5313, 29.8773],
                    '枣庄': [117.323, 34.8926],
                    '柳州': [109.3799, 24.9774],
                    '株洲': [113.5327, 27.0319],
                    '武汉': [114.3896, 30.6628],
                    '汕头': [117.1692, 23.3405],
                    '江门': [112.6318, 22.1484],
                    '沈阳': [123.1238, 42.1216],
                    '沧州': [116.8286, 38.2104],
                    '河源': [114.917, 23.9722],
                    '泉州': [118.3228, 25.1147],
                    '泰安': [117.0264, 36.0516],
                    '泰州': [120.0586, 32.5525],
                    '济南': [117.1582, 36.8701],
                    '济宁': [116.8286, 35.3375],
                    '海口': [110.3893, 19.8516],
                    '淄博': [118.0371, 36.6064],
                    '淮安': [118.927, 33.4039],
                    '深圳': [114.5435, 22.5439],
                    '清远': [112.9175, 24.3292],
                    '温州': [120.498, 27.8119],
                    '渭南': [109.7864, 35.0299],
                    '湖州': [119.8608, 30.7782],
                    '湘潭': [112.5439, 27.7075],
                    '滨州': [117.8174, 37.4963],
                    '潍坊': [119.0918, 36.524],
                    '烟台': [120.7397, 37.5128],
                    '玉溪': [101.9312, 23.8898],
                    '珠海': [113.7305, 22.1155],
                    '盐城': [120.2234, 33.5577],
                    '盘锦': [121.9482, 41.0449],
                    '石家庄': [114.4995, 38.1006],
                    '福州': [119.4543, 25.9222],
                    '秦皇岛': [119.2126, 40.0232],
                    '绍兴': [120.564, 29.7565],
                    '聊城': [115.9167, 36.4032],
                    '肇庆': [112.1265, 23.5822],
                    '舟山': [122.2559, 30.2234],
                    '苏州': [120.6519, 31.3989],
                    '莱芜': [117.6526, 36.2714],
                    '菏泽': [115.6201, 35.2057],
                    '营口': [122.4316, 40.4297],
                    '葫芦岛': [120.1575, 40.578],
                    '衡水': [115.8838, 37.7161],
                    '衢州': [118.6853, 28.8666],
                    '西宁': [101.4038, 36.8207],
                    '西安': [109.1162, 34.2004],
                    '贵阳': [106.6992, 26.7682],
                    '连云港': [119.1248, 34.552],
                    '邢台': [114.8071, 37.2821],
                    '邯郸': [114.4775, 36.535],
                    '郑州': [113.4668, 34.6234],
                    '鄂尔多斯': [108.9734, 39.2487],
                    '重庆': [107.7539, 30.1904],
                    '金华': [120.0037, 29.1028],
                    '铜川': [109.0393, 35.1947],
                    '银川': [106.3586, 38.1775],
                    '镇江': [119.4763, 31.9702],
                    '长春': [125.8154, 44.2584],
                    '长沙': [113.0823, 28.2568],
                    '长治': [112.8625, 36.4746],
                    '阳泉': [113.4778, 38.0951],
                    '青岛': [120.4651, 36.3373],
                    '韶关': [113.7964, 24.7028]
                },
                data: [{ 'code': '广东-深圳', 'count': 0.79032492889269 }, { 'code': '广东-广州', 'count': 0.018896571831812 }, { 'code': '广东-东莞', 'count': 0.012689909907906 }, { 'code': '广东-惠州', 'count': 0.0080740939889144 }, { 'code': '北京-北京', 'count': 0.007646029345064 }, { 'code': '四川-成都', 'count': 0.0060496984171632 }, { 'code': '湖北-武汉', 'count': 0.0059299746206423 }, { 'code': '重庆-重庆', 'count': 0.0051780414642094 }, { 'code': '湖南-长沙', 'count': 0.0051339521045067 }, { 'code': '广东-河源', 'count': 0.0048029399262376 }, { 'code': '广东-汕头', 'count': 0.0039514394168876 }, { 'code': '上海-上海', 'count': 0.0038879126144318 }, { 'code': '广东-汕尾', 'count': 0.0037320552911397 }, { 'code': '广东-梅州', 'count': 0.0036349274022235 }, { 'code': '广东-清远', 'count': 0.0033558418903189 }, { 'code': '广东-佛山', 'count': 0.0032080860821634 }, { 'code': '陕西-西安', 'count': 0.0028981726837407 }, {
                    'code': '福建-福州',
                    'count': 0.0026217495519274
                }, { 'code': '广东-茂名', 'count': 0.0025900745230657 }, { 'code': '湖南-衡阳', 'count': 0.0025684496378833 }, { 'code': '河南-开封', 'count': 0.0025673868819039 }, { 'code': '广东-揭阳', 'count': 0.0024836618755265 }, { 'code': '贵州-贵阳', 'count': 0.0024707418301061 }, { 'code': '浙江-杭州', 'count': 0.0023657666018655 }, { 'code': '河南-郑州', 'count': 0.0023137393043784 }, { 'code': '广东-湛江', 'count': 0.0021597805522412 }, { 'code': '四川-眉山', 'count': 0.0021146351038317 }, { 'code': '江西-赣州', 'count': 0.0019453320467011 }, { 'code': '湖南-娄底', 'count': 0.0018973658942438 }, { 'code': '广西-北海', 'count': 0.0018073227069451 }, { 'code': '河南-南阳', 'count': 0.0017971582846775 }, { 'code': '广东-中山', 'count': 0.0017789763135512 }, { 'code': '江西-南昌', 'count': 0.001746849269209 }, { 'code': '河南-新乡', 'count': 0.0016322216922006 }, { 'code': '河南-商丘', 'count': 0.0016133613415014 }, {
                    'code': '河南-驻马店',
                    'count': 0.0015879492086901
                }, { 'code': '湖北-孝感', 'count': 0.0015438834251702 }, { 'code': '海南-海口', 'count': 0.0015170392257325 }, { 'code': '广东-珠海', 'count': 0.0014704417716923 }, { 'code': '江西-新余', 'count': 0.0014667073091853 }, { 'code': '湖南-郴州', 'count': 0.0014644775991808 }, { 'code': '四川-南充', 'count': 0.0014562071396798 }, { 'code': '广西-桂林', 'count': 0.0013679003015687 }, { 'code': '黑龙江-鸡西', 'count': 0.0013609933963944 }, { 'code': '贵州-遵义', 'count': 0.0013567984315403 }, { 'code': '湖北-荆州', 'count': 0.0013534124740025 }, { 'code': '陕西-安康', 'count': 0.0013314467664492 }, { 'code': '内蒙古-鄂尔多斯', 'count': 0.0013026887886449 }, { 'code': '河南-信阳', 'count': 0.0012963260079929 }, { 'code': '广东-潮州', 'count': 0.0012501856162352 }, { 'code': '宁夏-银川', 'count': 0.0012060084280876 }, { 'code': '海南-三亚', 'count': 0.001168724181351 }, { 'code': '湖南-永州', 'count': 0.0011548020409119 }, {
                    'code': '江苏-南京',
                    'count': 0.0011509229052913
                }, { 'code': '辽宁-沈阳', 'count': 0.0011350802750971 }, { 'code': '江西-抚州', 'count': 0.0011339614581581 }, { 'code': '福建-厦门', 'count': 0.0011330401148977 }, { 'code': '安徽-合肥', 'count': 0.001096362785513 }, { 'code': '河北-廊坊', 'count': 0.0010757945817877 }, { 'code': '浙江-湖州', 'count': 0.001059839479602 }, { 'code': '广西-梧州', 'count': 0.0010557363433143 }, { 'code': '河北-石家庄', 'count': 0.0010417926402705 }, { 'code': '加利福尼亚州-旧金山', 'count': 9.2958276053798E-4 }, { 'code': '黑龙江-哈尔滨', 'count': 9.1705944834823E-4 }, { 'code': '江苏-连云港', 'count': 9.1139901571145E-4 }, { 'code': '湖南-邵阳', 'count': 8.984523072552E-4 }, { 'code': '河北-秦皇岛', 'count': 8.3960092787055E-4 }, { 'code': '内蒙古-呼和浩特', 'count': 8.0904453346982E-4 }, { 'code': '安徽-芜湖', 'count': 7.3463080006101E-4 }, { 'code': '广西-贺州', 'count': 7.1544552648664E-4 }, { 'code': '海南-万宁', 'count': 7.0248418276833E-4 }, {
                    'code': '江苏-苏州',
                    'count': 6.7984772932133E-4
                }, { 'code': '新疆-石河子', 'count': 6.5850921362606E-4 }, { 'code': '广西-贵港', 'count': 6.5615768127012E-4 }, { 'code': '黑龙江-佳木斯', 'count': 6.1015081774496E-4 }, { 'code': '四川-绵阳', 'count': 6.0987843871648E-4 }, { 'code': '内华达州-拉斯维加斯', 'count': 5.8546377510616E-4 }, { 'code': '湖南-常德', 'count': 5.416101537019E-4 }, { 'code': '湖南-株洲', 'count': 5.3775474698507E-4 }, { 'code': '河南-漯河', 'count': 5.32910414371E-4 }, { 'code': '山东-临沂', 'count': 5.3238855739262E-4 }, { 'code': '广西-柳州', 'count': 5.3238855739262E-4 }, { 'code': '河北-邯郸', 'count': 5.1863096408924E-4 }, { 'code': '四川-泸州', 'count': 5.1017439484777E-4 }, { 'code': '江西-宜春', 'count': 4.8648434679656E-4 }, { 'code': '山东-济宁', 'count': 4.6071141376163E-4 }, { 'code': '吉林-白山', 'count': 4.5934311887272E-4 }, { 'code': '陕西-宝鸡', 'count': 4.5934311887272E-4 }, { 'code': '广西-玉林', 'count': 4.527162250088E-4 }, {
                    'code': '广东-阳江',
                    'count': 4.5107265937171E-4
                }, { 'code': '广西-防城港', 'count': 4.4558552556934E-4 }, { 'code': '江苏-常州', 'count': 4.4558552556934E-4 }, { 'code': '辽宁-大连', 'count': 4.432339932134E-4 }, { 'code': '福建-南平', 'count': 4.2324738876595E-4 }, { 'code': '湖南-湘潭', 'count': 4.102601074325E-4 }, { 'code': '广西-河池', 'count': 4.0861943351511E-4 }, { 'code': '吉林-延边朝鲜族自治州', 'count': 4.0023899021424E-4 }, { 'code': '天津-天津', 'count': 3.9387860274471E-4 }, { 'code': '四川-达州', 'count': 3.6271522291906E-4 }, { 'code': '湖北-襄阳', 'count': 3.447955913045E-4 }]
            }
        },
        mounted () {
            this.chart = echarts.init(this.$refs.chartMap)
            this.chart.showLoading()
            this.dealData()
            this.initChart()
        },
        methods: {
            initChart () {
                const that = this
                this.chart.hideLoading()
                this.chart.setOption({
                    geo: {
                        map: 'china',
                        layoutCenter: ['40%', '20%'],   //地图位置  或者用left,top 等
                        layoutSize: '200%',  //地图大小
                        label: {
                            // emphasis: {
                            //     show: true,
                            // },
                            normal: {
                                show: true,
                                textStyle: {
                                    color: 'rgba(255,255,255,0.4)'
                                },
                                emphasis: {//对应的鼠标悬浮效果
                                    show: true,
                                    textStyle: { color: '#fff' }
                                }
                            }
                        },
                        roam: true,
                        itemStyle: {
                            normal: {
                                areaColor: '#00295e',  //地图颜色
                                borderColor: '#0e7fb9'
                            },
                            emphasis: {
                                areaColor: '#3363a1'  //鼠标悬停颜色
                            }
                        }
                    },
                    series: [
                        {
                            name: '游客来源',
                            type: 'lines',
                            zlevel: 1,
                            effect: {
                                show: true,
                                period: 6,
                                trailLength: 0.7,
                                color: '#fff',
                                symbolSize: 3
                            },
                            lineStyle: {
                                normal: {
                                    color: '#23cefe',
                                    width: 0,
                                    curveness: 0.2
                                }
                            },
                            data: that.convertData(that.SZdata)
                        }, {
                            name: '游客来源',
                            type: 'lines',
                            zlevel: 2,
                            symbol: ['none', 'arrow'],
                            symbolSize: 10,
                            effect: {  //特效
                                show: true,
                                period: 6,
                                trailLength: 0,
                                symbol: 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z',
                                symbolSize: 15
                            },
                            lineStyle: {
                                normal: {
                                    color: '#23cefe',
                                    width: 1,
                                    opacity: 0.6,
                                    curveness: 0.2
                                }
                            },
                            data: that.convertData(that.SZdata)
                        }, {
                            name: '游客来源',
                            type: 'effectScatter',
                            coordinateSystem: 'geo',
                            zlevel: 2,
                            rippleEffect: {
                                brushType: 'stroke'
                            },
                            label: {
                                normal: {
                                    show: true,
                                    position: 'right',
                                    formatter: '{b}'
                                }
                            },
                            symbolSize: function (count) {
                                if (count) {
                                    return count[2].count / 8
                                }

                            },
                            itemStyle: {
                                normal: {
                                    color: '#23cefe'
                                }
                            },
                            data: that.SZdata.map(function (dataItem) {
                                if (that.geoCoordMap[dataItem[1].code]) {
                                    return {
                                        name: dataItem[1].code,
                                        value: that.geoCoordMap[dataItem[1].code].concat([dataItem[1]])
                                    }
                                }

                            })
                        }]
                })
            },
            dealData () {
                const that = this
                let res = []
                const obj = { name: '深圳' }
                let data = that.data.slice(0, 30)
                let geoCoordMap = that.geoCoordMap

                let sum = []
                data.forEach(item => {
                    let temp = []
                    item.count = item.count * 200
                    for (let key in geoCoordMap) {
                        if (new RegExp(key).test(item.code)) {
                            item.code = key
                            break
                        }
                    }
                    temp.push(obj)  //插入起点
                    temp.push(item)  //插入终点和值
                    sum.push(temp)
                })
                that.SZdata = sum
            },
            convertData (data) {
                const geoCoordMap = this.geoCoordMap
                const res = []
                for (let i = 0; i < data.length; i++) {
                    let dataItem = data[i]
                    if (!geoCoordMap[dataItem[0].name]) continue
                    let fromCoord = geoCoordMap[dataItem[0].name]
                    let toCoord = geoCoordMap[dataItem[1].code]
                    if (fromCoord && toCoord) {
                        res.push({
                            fromName: dataItem[0].name,  //从这个城市
                            toName: dataItem[1].code, //到这个城市
                            coords: [toCoord, fromCoord] //两个地点的坐标
                        })
                    }
                }
                return res
            }
        }
    }
</script>

<style scoped>
    .charts {
        width: 100%;
        height: 100%;
    }
</style>
